studyapppw1/src/Documents/Производство/Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Производство</name>
  <registerRecords>AccumulationRegister.СтоимостныеПоказатели</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.ГотоваяПродукция</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическоеКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроизводства</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьМатериалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщиеЗатратыНаПроизводство</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

studyapppw1/src/Documents/Производство/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)

    Строка = Элементы.Материалы.ТекущиеДанные;

    Если Строка.Материал <> Неопределено Тогда
        Строка.Цена = ПолучитьЦенуЗакупки(Строка.Материал);
    Иначе
        Строка.Цена = 0;
    КонецЕсли;

    ПересчитатьСтрокуМатериалов(Строка);
    ПересчитатьСтоимостьМатериалов();
    ПересчитатьОбщиеЗатраты();

    Элементы.Материалы.Обновить();

КонецПроцедуры 

&НаСервере
Функция ПолучитьЦенуЗакупки(МатериалСсылка) Экспорт

    Если МатериалСсылка = Неопределено Тогда
        Возврат 0;
    КонецЕсли;

    Попытка
        МатериалОбъект = МатериалСсылка.ПолучитьОбъект();
        Возврат МатериалОбъект.ЦенаЗакупки;
    Исключение
        Возврат 0;
    КонецПопытки;

КонецФункции


&НаКлиенте
Процедура ПересчитатьСтрокуМатериалов(Строка)

    Если Строка = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если Строка.Количество = Неопределено Тогда Строка.Количество = 0; КонецЕсли;
    Если Строка.Цена = Неопределено Тогда Строка.Цена = 0; КонецЕсли;

    Норматив = 1;
    Если Строка.Материал <> Неопределено Тогда
        Норматив = ПолучитьНормативРасхода(Строка.Материал);
    КонецЕсли;

    КоличествоСНормой = Строка.Количество * Норматив;

    Строка.Стоимость = КоличествоСНормой * Строка.Цена;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтоимостьМатериалов()

	Сумма = 0;

	Для Каждого Стр Из Объект.Материалы Цикл
		Если Стр.Стоимость <> Неопределено Тогда
			Сумма = Сумма + Стр.Стоимость;
		КонецЕсли;
	КонецЦикла;

	Объект.СтоимостьМатериалов = Сумма;

КонецПроцедуры   


&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
    Строка = Элементы.Материалы.ТекущиеДанные;
    ПересчитатьСтрокуМатериалов(Строка);
    ПересчитатьСтоимостьМатериалов();
    ПересчитатьОбщиеЗатраты();
    Элементы.Материалы.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
    Строка = Элементы.Материалы.ТекущиеДанные;
    ПересчитатьСтрокуМатериалов(Строка);
    ПересчитатьСтоимостьМатериалов();
    ПересчитатьОбщиеЗатраты();
    Элементы.Материалы.Обновить();
КонецПроцедуры    


&НаКлиенте
Процедура ПересчитатьОбщиеЗатраты()

    Если Объект.СтоимостьМатериалов = Неопределено Тогда
        Объект.СтоимостьМатериалов = 0;
    КонецЕсли;

    Если Объект.ВремяВыполненияЭтапа = Неопределено Тогда
        Объект.ВремяВыполненияЭтапа = 0;
    КонецЕсли;

    Ставка = 0;
    Если Объект.Исполнитель <> Неопределено Тогда
        Ставка = ПолучитьЧасовуюСтавку(Объект.Исполнитель);
    КонецЕсли;

    СтоимостьРаботы = Объект.ВремяВыполненияЭтапа * Ставка;

    Объект.ОбщиеЗатратыНаПроизводство =
        Объект.СтоимостьМатериалов + СтоимостьРаботы;

КонецПроцедуры


&НаСервере
Функция ПолучитьЧасовуюСтавку(СотрудникСсылка) Экспорт

    Если СотрудникСсылка = Неопределено Тогда
        Возврат 0;
    КонецЕсли;

    Попытка
        СотрОбъект = СотрудникСсылка.ПолучитьОбъект();
        Если СотрОбъект.ЧасоваяСтавка = Неопределено Тогда
            Возврат 0;
        КонецЕсли;

        Возврат СотрОбъект.ЧасоваяСтавка;
    Исключение
        Возврат 0;
    КонецПопытки;

КонецФункции


&НаСервере
Функция ПолучитьНормативРасхода(МатериалСсылка) Экспорт

    Если МатериалСсылка = Неопределено Тогда
        Возврат 1;
    КонецЕсли;

    Попытка
        МатериалОбъект = МатериалСсылка.ПолучитьОбъект();

        Норматив = МатериалОбъект.НормативРасхода;

        Если Норматив = Неопределено Или Норматив = 0 Тогда
            Возврат 1;
        КонецЕсли;

        Возврат Норматив;

    Исключение
        Возврат 1;
    КонецПопытки;

КонецФункции
